#include<iostream>
#include<windows.h>
#include <conio.h>
using namespace std;

	int tem[13][13];  //当前帧的内容 
	int last[13][13]; 
	 //上一帧的内容 
	int speed =1000; //游戏速度 
	int px=3,py=1; //位置 
	int key=72;//
	int yellow_key=9;//黄钥匙 
	int blue_key=0;//蓝钥匙 
	int red_key=0;//红钥匙 
	int health=1000;//血量 
	int attack=10;//攻击 
	int defence=10;//防御 
	int coin=0;//金钱 
	int floor=0;//楼层 
	bool on_stair=0;//是否在楼梯上 
	int mota[50][13][13]={
		
		{//第一层 
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,05,00,00,00,00,00,00,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,00,01},
			{01,00,00,00,04,00,01,00,00,00,01,00,01},
			{01,00,00,00,01,00,01,00,00,00,01,00,01},
			{01,01,04,01,01,00,01,01,01,04,01,00,01},
			{01,00,00,00,01,00,04,00,00,00,01,00,01},
			{01,00,00,00,01,00,01,01,01,01,01,00,01},
			{01,01,04,01,01,00,00,00,00,00,00,00,01},
			{01,00,00,00,01,01,04,01,01,01,04,01,01},
			{01,00,00,03,01,03,00,00,01,00,00,00,01},
			{01,00,00,03,01,00,00,00,01,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		}, 
		
		{//2
			{01,01,01,01,01,01,01,01,01,01,01,01,01}, 
			{01,06,00,00,00,00,00,00,00,00,00,00,01}, 
			{01,00,00,01,01,00,00,00,00,00,01,01,01}, 
			{01,00,01,01,01,01,01,00,01,01,01,01,01}, 
			{01,00,01,00,00,01,00,00,00,01,00,00,01}, 
			{01,00,01,00,00,00,00,00,00,00,00,00,01}, 
			{01,00,01,01,01,01,00,00,00,01,01,01,01}, 
			{01,00,01,00,00,01,00,00,00,01,00,00,01}, 
			{01,00,01,00,00,00,00,00,00,00,00,00,01}, 
			{01,00,01,01,01,01,00,00,00,01,01,01,01}, 
			{01,00,01,00,00,01,00,00,00,01,00,00,01}, 
			{01,05,01,00,00,00,00,00,00,00,00,00,01}, 
			{01,01,01,01,01,01,01,01,01,01,01,01,01}, 
		} ,
		
		{//3
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,03,00,01,03,00,03,01,00,01,00,00,01},
			{01,00,00,01,00,03,00,01,00,04,00,00,01},
			{01,00,00,01,03,00,03,01,00,01,01,01,01},
			{01,04,01,01,01,00,01,01,00,01,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,04,01,01,00,00,00,01,00,01,01,01,01},
			{01,00,00,01,01,00,01,01,00,01,00,00,01},
			{01,00,03,01,00,00,00,01,00,04,00,03,01},
			{01,00,00,01,00,00,00,01,00,01,01,01,01},
			{01,01,01,01,01,00,01,01,00,01,00,00,01},
			{01,06,00,00,00,00,00,01,00,04,00,05,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		{//4
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,00,00,00,01,00,7,9,01,00,00,00,01},
			{01,00,00,03,01,00,00,00,01,03,00,00,01},
			{01,00,00,00,01,00,00,00,01,00,00,00,01},
			{01,01,04,01,01,01,00,01,01,01,04,01,01}, 
			{01,00,00,00,04,00,00,00,00,00,00,00,01},
			{01,00,00,00,01,01,01,01,01,01,01,01,01},
			{01,00,11,00,00,00,00,00,00,00,00,00,01},
			{01,04,01,01,04,01,01,01,04,01,01,04,01},
			{01,00,01,00,00,00,01,00,00,00,01,00,01},
			{01,00,01,00,00,03,01,00,00,00,01,11,01},
			{01,05,01,03,00,03,01,00,00,00,01,06,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		{//5
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,05,01,00,00,04,00,01,00,00,04,00,01},
			{01,00,01,00,00,01,03,01,00,00,01,00,01},
			{01,00,04,00,00,01,00,01,03,03,01,00,01},
			{01,01,01,01,04,01,00,01,03,03,01,00,01},
			{01,03,00,00,00,01,00,01,01,01,01,00,01},
			{01,03,00,00,00,01,00,00,00,00,00,00,01},
			{01,01,00,01,01,01,00,01,01,01,01,00,01},
			{01,00,00,00,00,01,00,01,00,00,00,00,01},
			{01,00,03,00,00,01,00,01,04,01,01,01,01},
			{01,01,01,01,01,01,00,01,00,01,00,00,01},
			{01,00,00,00,00,00,00,01,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		
		{//6
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		
		{//7
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		
		{//8
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		
		{//9
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		
		{//10
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,00,00,00,00,00,00,00,00,00,00,00,01},
			{01,01,01,01,01,01,01,01,01,01,01,01,01},
		} ,
		
	};
	/*
	1 墙 
	0 空地 
	2 主角 
	3 黄钥匙 
	4 黄门 〓
	5 上行楼梯 △
	6 下行楼梯 ▽ 
	*/
	
	void GotoXY(int x, int y)  // 移动 
{
 	HANDLE hout;  //屏幕尺寸 变量 
	COORD coord={x,y};  //光标坐标 变量  光标x标  光标y标 
	hout=GetStdHandle(STD_OUTPUT_HANDLE);  //获得屏幕尺寸 
	SetConsoleCursorPosition(hout,coord);  //移动光标 
}


	//伤害计算函数 ，返回值是战斗中玩家受到的伤害 
	int battle(int monster_attack,int monster_defence,int monster_health,int player_health){
		player_health=health;
		if( (attack-monster_defence)>=monster_health ||defence>=monster_attack)return 0;
		else{
			while(1){
				monster_health=monster_health-(attack-monster_defence);
				if(monster_health<=0)break;
				player_health=player_health-(monster_attack-defence);
				if(player_health<=0)break;
			}
		} 
		return (health-player_health);
	}
	
	
//彩色输出的函数 
void COLOR_PRINT(const char* s, int color)
{
	HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(handle, FOREGROUND_INTENSITY | color);
	printf(s);
	SetConsoleTextAttribute(handle, FOREGROUND_INTENSITY | 7);
}
	
	
	//为下面的keydown函数服务的move函数 
	void moveto(int y,int x){
		if(mota[floor][y][x]==1){} //如果是墙就什么也不做 
		if(mota[floor][y][x]==0||mota[floor][y][x]==3||mota[floor][y][x]==5||mota[floor][y][x]==6||mota[floor][y][x]==7||mota[floor][y][x]==9){//如果是空地或黄钥匙就向左移动 
			px=x;
			py=y;
		} 
		
		if(mota[floor][y][x]==4){//如果是黄门 
			if(yellow_key<=0){}//如果没有黄钥匙，就什么也不做
			else{//如果有黄钥匙，就消耗黄钥匙开门，并将UI中黄钥匙的数量减1 
				yellow_key--;
				mota[floor][y][x]=0;
				GotoXY(31,0);
				cout<<"     ";
				GotoXY(31,0);
				cout<<yellow_key;
			} 
		} 
		
		if(mota[floor][y][x]==8){//如果是蓝门 
			if(blue_key<=0){}
			else{
				blue_key--;
				mota[floor][y][x]=0;
				GotoXY(31,1);
				cout<<"     ";
				GotoXY(31,1);
				cout<<blue_key;
			} 
		} 
		
		if(mota[floor][y][x]==10){//如果是红门 
			if(red_key<=0){}
			else{
				red_key--;
				mota[floor][y][x]=0;
				GotoXY(31,2);
				cout<<"     ";
				GotoXY(31,2);
				cout<<red_key;
			} 
		} 
		
		if(mota[floor][y][x]==11){//绿史莱姆 
			if( battle(18,1,35,health) >=health){}
			else{
				mota[floor][y][x]=0;
				py=y;
				px=x;
				health=health-battle(18,1,35,health);
				GotoXY(31,3);
				cout<<"        ";
				GotoXY(31,3);
				cout<<health;
				
				coin=coin+1;
				GotoXY(31,6);
				cout<<"         ";
				GotoXY(31,6);
				cout<<coin;
			}
		}
		
		if(mota[floor][y][x]!=5&&mota[floor][y][x]!=6)on_stair=0;
	}
	
	
	void keydown()
{
	if (_kbhit())//如果用户按下了键盘中的某个键
	{
		fflush(stdin);//清空缓冲区的字符
		//getch()读取方向键的时候，会返回两次，第一次调用返回0或者224，第二次调用返回的才是实际值
		key = _getch();//第一次调用返回的不是实际值
		key = _getch();//第二次调用返回实际值
	}

	/*
	控制台按键所代表的数字
	*“↑”：72
	*“↓”：80
	*“←”：75
	*“→”：77
	*/
	 
	switch (key)
	{
	case 75:// 左键，px-1 
		moveto(py,px-1);
		break;
	case 77://右键，px+1 
		moveto(py,px+1);
		break;
	case 72://上键，py-1 
		moveto(py-1,px);
		break;
	case 80://下键，py+1 
		moveto(py+1,px);
		break;
	}
	key=0; 
	GotoXY(1,11);
	return;
}
	//初始化函数 
	void init(){
	for (int i=0;i<13;i++){
		for(int j=0;j<13;j++)
		{
			tem[i][j]=mota[floor][i][j];
			last[i][j]=-1;
		}	
	}
}
	
	void update(){
		//将tem写入last 
		for (int i=0;i<13;i++){
		for(int j=0;j<13;j++)
		{
			last[i][j]=tem[i][j];
		}	
	}
		//将地图以及角色写入tem 
		for (int i=0;i<13;i++){
			for(int j=0;j<13;j++)
			{
				 tem[i][j]=mota[floor][i][j];
			}	
		}
		tem[py][px]=2;
	}
	
	
	void draw(){
		for(int u=0;u<13;u++){
			for(int t=0;t<13;t++){
				if(tem[u][t]!=last[u][t]){
					GotoXY(2*t,u);
					if(tem[u][t]==0)cout<<"·";
					if(tem[u][t]==1)cout<<"■";
					if(tem[u][t]==2)cout<<"勇";
					if(tem[u][t]==3)COLOR_PRINT("钥",6);
					if(tem[u][t]==4)COLOR_PRINT("〓",6);
					if(tem[u][t]==5)cout<<"◣";
					if(tem[u][t]==6)cout<<"◢";
					if(tem[u][t]==7)COLOR_PRINT("钥",1);
					if(tem[u][t]==8)COLOR_PRINT("〓",1);
					if(tem[u][t]==9)COLOR_PRINT("钥",4);
					if(tem[u][t]==10)COLOR_PRINT("〓",4);
					if(tem[u][t]==11)COLOR_PRINT("⊙",2); 
				}
			}
		}
	}
	
	
	/*
	1 墙 
	0 空地 
	2 主角 
	3 黄钥匙 
	4 黄门 〓
	5 上行楼梯 ◣
	6 下行楼梯 ◢
	*/
	
	//隐藏光标	
void HideCursor(){
	HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE);
	CONSOLE_CURSOR_INFO CursorInfo;
	GetConsoleCursorInfo(handle, &CursorInfo);//获取控制台光标信息
	CursorInfo.bVisible = false; //隐藏控制台光标
	SetConsoleCursorInfo(handle, &CursorInfo);//设置控制台光标状态
} 
	
	//反应函数 
	void react(){
	if(mota[floor][py][px]==3){//捡起黄钥匙 
		mota[floor][py][px]=0;
		yellow_key=yellow_key+1;
		GotoXY(31,0);
		cout<<"    ";
		GotoXY(31,0);
		cout<<yellow_key;
	}
	
	if(mota[floor][py][px]==7){//捡起蓝钥匙 
		blue_key=blue_key+1;
		GotoXY(31,1);
		mota[floor][py][px]=0;
		cout<<"    ";
		GotoXY(31,1);
		cout<<blue_key;
	}
	
	if(mota[floor][py][px]==9){//捡起红钥匙 
		mota[floor][py][px]=0;
		red_key=red_key+1;
		GotoXY(31,2);
		cout<<"    ";
		GotoXY(31,2);
		cout<<red_key;
	}
	
	if(mota[floor][py][px]==5&&on_stair==0){//上楼 
			floor++;
			on_stair=1;
	} 
	
	if(mota[floor][py][px]==6&&on_stair==0){//下楼 
			floor--;
			on_stair=1;
	} 
}
	

	
	int main(){
	system("cls");
	SetConsoleTitle("魔塔 by LCH");
	HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(handle, FOREGROUND_INTENSITY | 7);
	init();
	draw(); 
	
	//输出UI
	GotoXY(28,0);
	COLOR_PRINT("钥",6);
	cout<<" "<<yellow_key;
	GotoXY(28,1);
	COLOR_PRINT("钥",1);
	cout<<" "<<blue_key;
	GotoXY(28,2);
	COLOR_PRINT("钥",4);
	cout<<" "<<red_key;
	GotoXY(28,3);
	COLOR_PRINT("血",4);
	cout<<" "<<health;
	GotoXY(28,4);
	COLOR_PRINT("攻",7);
	cout<<" "<<attack;
	GotoXY(28,5);
	COLOR_PRINT("防",7);
	cout<<" "<<defence;
	GotoXY(28,6);
	COLOR_PRINT("金",6);
	cout<<" "<<coin;

	//渲染 //这是当前帧输出的内容
	for(int n=0;n<13;n++){
		for(int m=0;m<13;m++){
			tem[n][m]=mota[floor][n][m];
		}
	}  
	
	//游戏主函数
	while(1){
		keydown();
		update(); 
		draw(); 
		HideCursor();
		react(); 
		Sleep(200);
	}
}
