return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,1,1,1,2,1,9,1,2,56,1,57,2},
        {2,1,60,1,2,1,1,1,2,1,55,1,2},
        {2,1,1,1,2,113,2,110,2,51,1,51,2},
        {2,2,8,2,2,1,2,1,2,2,8,2,2},
        {2,107,1,107,2,3,2,4,2,113,1,113,2},
        {2,1,1,1,2,1,2,1,2,1,1,1,2},
        {2,2,8,2,2,112,2,109,2,2,8,2,2},
        {2,107,1,107,2,1,1,1,2,112,1,112,2},
        {2,1,1,1,2,2,111,2,2,1,1,1,2},
        {2,2,3,2,2,1,1,1,2,2,3,2,2},
        {2,54,1,1,110,1,10,1,110,1,1,54,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "on_guard_kill",
            guards = {{x = 1, y = 5}, {x = 3, y = 5}},
            once = true,
            run = function()
                set_tile(2, 4, 1)
                msg("守卫门已打开")
            end
        },
        {
            trigger = "on_guard_kill",
            guards = {{x = 9, y = 5}, {x = 11, y = 5}},
            once = true,
            run = function()
                set_tile(10, 4, 1)
                msg("守卫门已打开")
            end
        },
        {
            trigger = "on_guard_kill",
            guards = {{x = 1, y = 8}, {x = 3, y = 8}},
            once = true,
            run = function()
                set_tile(2, 7, 1)
                msg("守卫门已打开")
            end
        },
        {
            trigger = "on_guard_kill",
            guards = {{x = 9, y = 8}, {x = 11, y = 8}},
            once = true,
            run = function()
                set_tile(10, 7, 1)
                msg("守卫门已打开")
            end
        }
    }
}
