return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,1,1,51,51,2,10,2,1,1,54,151,2},
        {2,122,1,51,51,2,1,2,119,1,1,1,2},
        {2,1,119,2,2,2,1,2,3,2,118,118,2},
        {2,1,1,3,52,2,1,2,56,2,1,1,2},
        {2,3,2,2,2,2,1,2,2,2,2,3,2},
        {2,1,118,1,1,1,1,1,1,1,118,1,2},
        {2,3,2,2,2,2,1,2,2,2,2,3,2},
        {2,1,1,2,57,2,113,2,55,3,1,1,2},
        {2,118,118,2,3,2,113,2,2,2,120,1,2},
        {2,1,1,1,124,2,1,2,51,51,1,120,2},
        {2,152,54,1,1,2,9,2,51,51,1,1,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "on_tile",
            tile = 151,
            condition_flag = 3,
            set_flag = 3,
            run = function()
                say("老人：双手剑士的攻击力太高，你最好能到一击必杀时再与他战斗。")
                note("老人", "双手剑士的攻击力太高，你最好能到一击必杀时再与他战斗。")
                set_tile(11, 1, 1)
            end
        },
        {
            trigger = "on_tile",
            tile = 152,
            run = function()
                if has_flag(2) then return end
                if has_flag(1) then
                    say("商人：魔塔有50层高，但似乎你不能直接到50楼。")
                    note("商人", "魔塔有50层高，但似乎你不能直接到50楼。")
                    set_tile(1, 11, 1)
                    set_flag(2)
                    return
                end
                say("商人：我有4把黄钥匙1把蓝钥匙，你出1000个金币就都给你。")
                local c = choose_menu("我太需要了", "下次再说")
                if c == 0 then
                    if take_money(1000) then
                        for i = 1, 4 do give(51) end
                        give(52)
                        set_flag(1)
                    else
                        say("商人：你的金币不够！")
                    end
                end
                drain()
            end
        }
    }
}
