return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,1,55,1,2,1,1,54,54,54,1,1,2},
        {2,1,1,151,2,4,2,2,2,2,2,4,2},
        {2,2,127,1,2,1,2,131,2,131,2,1,2},
        {2,2,4,2,2,1,1,1,1,1,1,1,2},
        {2,1,1,128,1,1,2,131,2,131,2,1,2},
        {2,1,2,2,3,2,2,2,2,2,2,1,2},
        {2,129,2,1,126,1,2,1,1,1,126,1,2},
        {2,1,2,56,1,54,2,2,8,2,2,1,2},
        {2,126,2,2,3,2,2,1,1,1,2,1,2},
        {2,1,2,1,130,1,2,1,64,1,2,1,2},
        {2,9,2,57,1,55,2,1,1,1,2,10,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "on_tile",
            x = 1, y = 3,
            once = true,
            run = function()
                -- 互动后墙变为魔法警卫
                set_tile(1, 3, 131)
            end
        },
        {
            trigger = "on_guard_kill",
            guards = {{x = 1, y = 3}},
            run = function()
                set_tile(8, 8, 1)
                msg("守卫门已打开")
            end
        },
        {
            trigger = "on_tile",
            tile = 151,
            once = true,
            run = function()
                say("老人：骰子上5的形状是一种封印魔法，你最好记住它，在你与49楼假魔王战斗时有用。")
                note("老人", "骰子上5的形状是一种封印魔法，你最好记住它，在你与49楼假魔王战斗时有用。")
                set_tile(3, 2, 1)
            end
        }
    }
}
