return {
    map = {
        {

		7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,2,2,2,2,2,7,7,7,7},
        {7,7,7,7,2,1,154,1,2,7,7,7,7},
        {7,7,7,7,2,1,1,1,2,7,7,7,7},
        {7,7,7,7,2,1,1,1,2,7,7,7,7},
        {7,7,7,7,2,2,2,2,2,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,7,7,7,7,7}
    },
    events = {
        {
            trigger = "on_tile",
            tile = 154,
            once = true,
            run = function()
                say("勇士：你怎么会在这里！你到底是谁？")
                say("小偷：我在这里只有一个理由，那就是...")
                -- 小偷化身为真魔王
                set_tile(6, 5, 135)
                say("勇士：啊！你就是魔王！你怎么还活着？")
                say("魔王：我是不会死的。以前我只是对你的能力做测试而已。")
                say("勇士：什么？你这是什么意思？你为什么要做这样的事情？")
                say("魔王：神圣剑就是你装备的武器，智慧权杖是我所装备的武器。先知说过无论谁使用它们都必须要有足够的智慧，且剑只能被真正的战士使用。")
                say("勇士：如你所说我就是那个战士。")
                say("魔王：是的，你是最适合的人选。但你刚到魔塔时，你的能力还不足以支配神圣剑。因此我在塔内安排了各类机关，让你通过战斗直到可以控制神圣剑。")
                say("勇士：很好，那么外面传说有一个公主被困在魔塔，就是为了把我骗到这里。是这样的吗？")
                say("魔王：是的现在如果我们能够合作那么这场闹剧就结束了。现在我们一起用权杖破坏神圣剑，这样伟大的时代就要降临了。")
                say("勇士：我不会让你毁了神圣剑，让黑暗降临。")
            end
        },
        {
            trigger = "on_guard_kill",
            guards = {{x = 6, y = 5}},
            once = true,
            run = function()
                show_victory()
            end
        }
    }
}
