return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,10,2,51,51,2,1,104,1,51,101,1,2},
        {2,1,2,51,51,2,1,2,2,2,2,3,2},
        {2,1,2,2,102,2,1,2,54,1,105,1,2},
        {2,1,3,3,1,3,1,2,152,1,1,103,2},
        {2,1,2,2,2,2,1,2,2,2,2,2,2},
        {2,1,1,102,104,1,51,1,105,106,1,1,2},
        {2,2,2,2,2,2,1,2,2,2,2,1,2},
        {2,104,1,1,151,2,1,3,3,1,3,1,2},
        {2,1,103,1,57,2,1,2,2,102,2,102,2},
        {2,3,2,2,2,2,1,2,1,1,2,1,2},
        {2,1,101,1,1,105,1,2,54,54,2,9,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "on_tile",
            x = 4, y = 8,
            once = true,
            actions = {
                { type = "call", func = function()
                    say("老人：你购买了商品后再与商人对话，他会告诉你一些重要的信息")
                    set_tile(4, 8, 1)
                end },
            }
        },
        {
            trigger = "on_tile",
            x = 8, y = 4,
            actions = {
                { type = "call", func = function()
                    if has_flag(2) then return end
                    if has_flag(1) then
                        say("商人：魔塔一共50层，每10层为一个区域。如果不打败此区域的头目就不能到达更高的地方。")
                        set_tile(8, 4, 1)
                        set_flag(2)
                        return
                    end
                    say("商人：我有一把蓝钥匙，你出50个金币我就卖给你")
                    local c = choose_menu("我太需要了", "下次再说")
                    if c == 0 then
                        if take_money(50) then
                            give(52)
                            set_flag(1)
                        else
                            say("商人：你的金币不够！")
                        end
                    end
                    drain()
                end },
            }
        }
    }
}
