return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,9,1,4,1,1,1,3,1,1,1,51,2},
        {2,1,1,2,1,152,1,2,1,2,2,57,2},
        {2,1,2,2,2,2,2,2,1,128,1,51,2},
        {2,1,2,1,3,127,1,2,3,2,2,2,2},
        {2,1,2,129,2,1,126,2,1,126,1,1,2},
        {2,1,3,1,2,1,1,2,51,1,1,129,2},
        {2,1,2,1,2,52,51,2,2,2,2,3,2},
        {2,1,2,1,4,56,57,2,1,1,1,1,2},
        {2,1,2,2,2,2,2,2,128,2,2,2,2},
        {2,1,1,2,54,1,56,2,1,2,1,1,2},
        {2,1,1,3,1,126,1,3,1,1,1,10,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "on_tile",
            tile = 152,
            run = function()
                if has_flag(2) then return end
                if has_flag(1) then
                    say("商人：如果要打败魔龙，你需要圣剑、圣盾、屠龙匕或更高级的装备。")
                    note("商人", "如果要打败魔龙，你需要圣剑、圣盾、屠龙匕或更高级的装备。")
                    set_tile(5, 2, 1)
                    set_flag(2)
                    return
                end
                say("商人：你给我4000个金币，我就给你地震卷轴，它可以摧毁一层楼的所有墙。")
                local c = choose_menu("我太需要了", "下次再说")
                if c == 0 then
                    if take_money(4000) then
                        give(78)
                        set_flag(1)
                    else
                        say("商人：你的金币不够！")
                    end
                end
                drain()
            end
        }
    }
}
