return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,9,2,56,2,1,152,1,2,51,2,101,2},
        {2,1,2,54,2,1,1,1,2,51,2,102,2},
        {2,1,2,103,2,102,2,106,2,54,2,101,2},
        {2,1,2,1,2,1,2,1,2,1,2,1,2},
        {2,3,2,3,2,4,2,3,2,105,2,3,2},
        {2,1,106,1,104,1,1,1,1,1,1,1,2},
        {2,3,2,3,2,3,2,3,2,106,2,3,2},
        {2,1,2,1,2,1,2,1,2,1,2,1,2},
        {2,1,2,1,2,103,2,102,2,55,2,1,2},
        {2,101,2,101,2,51,2,104,2,51,2,1,2},
        {2,1,102,1,2,51,2,55,2,51,2,10,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "on_tile",
            tile = 152,
            run = function()
                if has_flag(2) then return end
                if has_flag(1) then
                    say("商人：在祭坛你最好选择提升防御，只有在攻击力低于敌人的防御力时才提升攻击")
                    set_tile(6, 1, 1)
                    set_flag(2)
                    return
                end
                say("商人：我有五把黄钥匙，你出50个金币我就卖给你")
                local c = choose_menu("我太需要了", "下次再说")
                if c == 0 then
                    if take_money(50) then
                        for i = 1, 5 do give(51) end
                        set_flag(1)
                    else
                        say("商人：你的金币不够！")
                    end
                end
                drain()
            end
        }
    }
}
