return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,9,1,1,2,1,1,53,2,51,52,51,2},
        {2,1,1,128,2,1,1,1,2,51,51,51,2},
        {2,2,2,3,2,1,1,1,2,2,1,2,2},
        {2,151,1,1,2,2,130,2,2,126,1,127,2},
        {2,1,1,128,3,1,1,1,3,1,1,1,2},
        {2,3,2,2,2,2,133,2,2,1,1,126,2},
        {2,1,1,1,2,1,1,1,2,2,1,2,2},
        {2,2,2,129,2,1,1,1,2,131,1,131,2},
        {2,55,51,51,2,2,1,2,2,2,1,2,2},
        {2,129,2,2,2,1,125,1,2,51,51,51,2},
        {2,51,51,57,2,1,10,1,2,51,52,51,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
    events = {
        {
            trigger = "first_arrive",
            run = function()
                say("骑士队长：啊！又是你！！（转身逃跑）")
                
                -- 骑士队长逃跑过程

                sleep_ms(100)
                set_tile(6, 10, 1)
                set_tile(6, 9, 125)
                sleep_ms(100)
                set_tile(6, 9, 1)
                set_tile(6, 8, 125)

                sleep_ms(300)
                -- 魔王现身
                set_tile(6, 6, 133)

                say("魔王：骑士队长，你敢临阵脱逃！")

                -- 魔法警卫现身
                sleep_ms(300)
                set_tile(5, 8, 131)
                sleep_ms(300)
                set_tile(7, 8, 131)
                sleep_ms(300)
                set_tile(6, 7, 131)
                sleep_ms(300)
                set_tile(6, 9, 131)

                sleep_ms(500)

                -- 骑士队长被消灭
                set_tile(6, 8, 1)

                sleep_ms(300)
                say("魔王：虽然我刚才态度异常，但别担心,在决斗时，我不会像刚才这个无用的家伙一样让手下一拥而上。我期待着与你决斗。")

                -- 清除魔王和魔法警卫
                set_tile(6, 6, 1)
                set_tile(5, 8, 1)
                set_tile(7, 8, 1)
                set_tile(6, 7, 1)
                set_tile(6, 9, 1)
            end
        },
        {
            trigger = "on_tile",
            tile = 151,
            once = true,
            run = function()
                say("老人：巫师会用魔法攻击路过的人，在2个魔法警卫间通过会使你的生命减少一半。")
                note("老人", "巫师会用魔法攻击路过的人，在2个魔法警卫间通过会使你的生命减少一半。")
                set_tile(1, 4, 1)
            end
        }
    }
}
