return {
    map = {
        {

		2,2,2,2,2,2,2,2,2,2,2,2,2},
        {2,51,57,2,51,55,51,2,1,2,1,54,2},
        {2,1,54,2,55,51,55,2,1,3,103,1,2},
        {2,104,1,2,51,52,51,2,1,2,2,2,2},
        {2,3,2,2,2,1,2,2,1,2,1,151,2},
        {2,1,1,103,1,1,1,101,1,1,1,1,2},
        {2,3,2,2,1,1,1,2,1,2,2,2,2},
        {2,105,1,2,2,1,2,2,1,2,1,54,2},
        {2,1,51,2,1,1,1,2,1,3,104,51,2},
        {2,54,56,2,1,1,1,2,1,2,2,2,2},
        {2,2,2,2,2,1,2,2,102,2,1,1,2},
        {2,10,1,1,1,1,1,2,1,3,1,9,2},
        {2,2,2,2,2,2,2,2,2,2,2,2,2}
    },
        events = {
        {
            trigger = "on_tile",
            tile = 151,
            once = true,
            actions = {
                { type = "call", func = function()
                    say("我可以给你一本怪物手册，你可以用它预测该楼层各怪物对你造成的伤害。")
                    set_tile(11, 4, 1)
                end },
            }
        },
        {
            trigger = "on_tile",
            x = 5, y = 9,
            once = true,
            actions = {
                { type = "call", func = function()
                    set("x", 5)
                    set("y", 9)
                    set_tile(5, 7, 135)
                    set_tile(5, 8, 131)
                    set_tile(5, 10, 131)
                    set_tile(4, 9, 131)
                    set_tile(6, 9, 131)
                    sleep_ms(2000)
                    say("魔王：欢迎来到魔塔，你是第一百位挑战者。你若能打败我所有的手下，我就与你一对一的决斗。现在你必须接受我的安排。")
                    say("勇者：什么？")
                    darken_map()
                    set_tile(5, 7, 1)
                    set_tile(5, 8, 1)
                    set_tile(5, 10, 1)
                    set_tile(4, 9, 1)
                    set_tile(6, 9, 1)
                    set("x", 4)
                    set("y", 8)
                    set("floor", 2)
                    set("health", 400)
                    set("attack", 10)
                    set("defence", 10)
                    sleep_ms(2000)
                    lighten_map()
                end },
            }
        }
    }
}
